bench/results/raw/ab-20260923-232326/new-r2-h2c-_-c64-m1.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
Warm-up started for thread #1.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Application protocol: h2c
Warm-up started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 5.00s, 442389.40 req/s, 471.68MB/s
requests: 2211947 total, 2212011 started, 2211947 done, 2211947 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2211947 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.30GB (2472961034) total, 225.71MB (236678329) headers (space savings 42.78%), 2.05GB (2196463371) data
                     min         max         mean         sd        +/- sd
time for request:        3us      4.63ms       143us        46us    81.47%
time for connect:        7us        50us        24us        11us    65.63%
time to 1st byte:      155us      4.67ms      1.39ms      1.31ms    81.25%
req/s           :    6870.95     6955.54     6912.10       20.32    64.06%