bench/results/raw/ab-20260923-232326/new-r2-h2c-_-c64-m10.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #3.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up started for thread #2.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Application protocol: h2c
Warm-up started for thread #1.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1

finished in 5.00s, 611444.00 req/s, 651.93MB/s
requests: 3057220 total, 3057860 started, 3057220 done, 3057220 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3057220 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 3.18GB (3417976248) total, 311.97MB (327122540) headers (space savings 42.78%), 2.83GB (3035819460) data
                     min         max         mean         sd        +/- sd
time for request:        4us     85.95ms      1.06ms      1.26ms    89.29%
time for connect:        6us        51us        26us        10us    67.19%
time to 1st byte:      160us     85.98ms     30.90ms     27.91ms    50.00%
req/s           :    8885.76    10439.57     9553.44      378.42    68.75%